rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rust</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://orgmode.org/worg/style/worg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rust</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org14f3abd">Defaults</a></li>
<li><a href="#org1f401b9">Borrow (Reference)</a></li>
<li><a href="#orgb174e68">Ownership</a></li>
<li><a href="#org192a4a6">Move and Copy</a></li>
<li><a href="#orgd6e1c8b">lifetime</a>
<ul>
<li><a href="#orgc8aefb4">The compiler determines the lifetime of the returned reference based on these rules.</a></li>
<li><a href="#org8f8f76e">If the compiler cannot determine the output lifetime parameters, you need to annotate it for the compiler.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These are notes of watching <a href="https://www.youtube.com/playlist?list=PLai5B987bZ9CoVR-QEIN9foz4QCJ0H2Y8">this playlist</a>.
</p>

<div id="outline-container-org14f3abd" class="outline-2">
<h2 id="org14f3abd">Defaults</h2>
<div class="outline-text-2" id="text-org14f3abd">
<ul class="org-ul">
<li>immutable;</li>
<li>move
<ul class="org-ul">
<li>when the resource is on heap, implicit <code>unique_ptr</code>. (think in a C++ way)</li>
<li>when it is on stack, see <a href="#org192a4a6">Move and Copy</a>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1f401b9" class="outline-2">
<h2 id="org1f401b9">Borrow (Reference)</h2>
<div class="outline-text-2" id="text-org1f401b9">
<ul class="org-ul">
<li>One mutable ref, or any number of immutable ref.</li>
<li>Compiler checks whether a ref is still valid (the original copy does not go out of scope).</li>
<li>when a mutable variable is borrowed (even imutable borrow), you cannot mutate the original variable during borrowing.</li>
<li>no need to wait for the ref to go out of {}, as long as it is no longer used, its lifetime ends.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb174e68" class="outline-2">
<h2 id="orgb174e68">Ownership</h2>
<div class="outline-text-2" id="text-orgb174e68">
<p>
rust's ownership mode is just like c++ RAII (or <code>unique_ptr</code> if on heap). That is also why it is moved by default.
</p>
<ul class="org-ul">
<li>one and only one owner</li>
<li>when the owner goes out of scope, the resource is deallocated.</li>
</ul>
</div>
</div>

<div id="outline-container-org192a4a6" class="outline-2">
<h2 id="org192a4a6">Move and Copy</h2>
<div class="outline-text-2" id="text-org192a4a6">
<div class="org-src-container">
<pre class="src src-rust">let b = a;
func(a);
</pre>
</div>
<ul class="org-ul">
<li>For variables on the heap, or struct with variables on the heap, they are moved.</li>
<li>For variables on the stack that have copy trait implemented (e.g. primitives like i32), they are copied.</li>
<li>For variables on the stack that don't have copy trait implemented, they are "moved". In fact, they are copied, but the <a href="https://stackoverflow.com/questions/36230710/how-does-rust-move-stack-variables-that-are-not-copyable">original stack memory is marked as moved by the compliler</a>.</li>
<li><a href="https://doc.rust-lang.org/book/ch04-01-what-is-ownership.html?#what-is-ownership">Rust won’t let us annotate a type with Copy if the type, or any of its parts, has implemented the Drop trait.</a> This means for variables on the heap, or struct with variables on the heap, they cannot implement copy trait, thus always be moved.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd6e1c8b" class="outline-2">
<h2 id="orgd6e1c8b">lifetime</h2>
<div class="outline-text-2" id="text-orgd6e1c8b">
<p>
A function/method may return a reference.
</p>
</div>
<div id="outline-container-orgc8aefb4" class="outline-3">
<h3 id="orgc8aefb4">The compiler determines the lifetime of the returned reference based on these rules.</h3>
<div class="outline-text-3" id="text-orgc8aefb4">
<ul class="org-ul">
<li>Each parameter that is a ref gets its own lifetime parameter</li>
<li>If there is exactly one input lifetime parameter, that is assigned to all output lifetime parameters</li>
<li>If there are multiple input lifetime parameters, but one of them is &amp;self, or &amp;mut self. The lifetime of self is assigned to all output parameters</li>
</ul>
</div>
</div>
<div id="outline-container-org8f8f76e" class="outline-3">
<h3 id="org8f8f76e">If the compiler cannot determine the output lifetime parameters, you need to annotate it for the compiler.</h3>
<div class="outline-text-3" id="text-org8f8f76e">
<script src="https://utteranc.es/client.js"
        repo="sychen52/sychen52.github.io"
        issue-term="pathname"
        theme="github-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</div>
</div>
</div>
</body>
</html>
